[Timeout] BlockStatement
controller/api/v1/doctor_controller.js:7:8
 
 // handling new doctor registration
 module.exports.create = async function(req,res){
-    try{
-        if(req.body.password != req.body.confirm_password){
-            return res.status(200).json({
-                message: 'Passwords do not match'
-            })
-        }else{
-            let doctor = await Doctor.findOne({email: req.body.email});
-            if(doctor){
-                return res.status(200).json({
-                    message: 'You are already registered.Please signin'
-                })
-            }else{
-                await Doctor.create(req.body);
-                return res.status(200).json({
-                    message: 'You have successfully signed up'
-                })
-            }
-        }
-    }catch(err){
+    try{}catch(err){
         console.log("Error in doctor create controller",err);
         return res.status(500).json({

[Killed] BlockStatement
controller/api/v1/doctor_controller.js:8:59
 // handling new doctor registration
 module.exports.create = async function(req,res){
     try{
-        if(req.body.password != req.body.confirm_password){
-            return res.status(200).json({
-                message: 'Passwords do not match'
-            })
-        }else{
+        if(req.body.password != req.body.confirm_password){}else{
             let doctor = await Doctor.findOne({email: req.body.email});
             if(doctor){
killedBy: Doctor Controller Unit Tests should return message when passwords do not match
statusReason: expected false to be true

[Killed] ConditionalExpression
controller/api/v1/doctor_controller.js:8:12
 // handling new doctor registration
 module.exports.create = async function(req,res){
     try{
-        if(req.body.password != req.body.confirm_password){
+        if(false){
             return res.status(200).json({
                 message: 'Passwords do not match'
killedBy: Doctor Controller Unit Tests should return message when passwords do not match
statusReason: expected false to be true

[Timeout] BlockStatement
controller/api/v1/doctor_controller.js:12:14
             return res.status(200).json({
                 message: 'Passwords do not match'
             })
-        }else{
-            let doctor = await Doctor.findOne({email: req.body.email});
-            if(doctor){
-                return res.status(200).json({
-                    message: 'You are already registered.Please signin'
-                })
-            }else{
-                await Doctor.create(req.body);
-                return res.status(200).json({
-                    message: 'You have successfully signed up'
-                })
-            }
-        }
+        }else{}
     }catch(err){
         console.log("Error in doctor create controller",err);

[Killed] ConditionalExpression
controller/api/v1/doctor_controller.js:14:16
             })
         }else{
             let doctor = await Doctor.findOne({email: req.body.email});
-            if(doctor){
+            if(true){
                 return res.status(200).json({
                     message: 'You are already registered.Please signin'
killedBy: Hospital API Integration Tests should register a doctor via /api/v1/doctors/register
statusReason: expected { Object (message) } to have property 'message' of 'You have successfully signed up', but got 'You are already registered.Please sig…'

[Killed] ConditionalExpression
controller/api/v1/doctor_controller.js:14:16
             })
         }else{
             let doctor = await Doctor.findOne({email: req.body.email});
-            if(doctor){
+            if(false){
                 return res.status(200).json({
                     message: 'You are already registered.Please signin'
killedBy: Doctor Controller Unit Tests should return message when doctor already exists
statusReason: expected false to be true

[Timeout] BlockStatement
controller/api/v1/doctor_controller.js:18:18
                 return res.status(200).json({
                     message: 'You are already registered.Please signin'
                 })
-            }else{
-                await Doctor.create(req.body);
-                return res.status(200).json({
-                    message: 'You have successfully signed up'
-                })
-            }
+            }else{}
         }
     }catch(err){

[Killed] ObjectLiteral
controller/api/v1/doctor_controller.js:20:45
                 })
             }else{
                 await Doctor.create(req.body);
-                return res.status(200).json({
-                    message: 'You have successfully signed up'
-                })
+                return res.status(200).json({})
             }
         }
killedBy: Hospital API Integration Tests should register a doctor via /api/v1/doctors/register
statusReason: expected {} to have property 'message'

[Survived] BlockStatement
controller/api/v1/doctor_controller.js:25:16
                 })
             }
         }
-    }catch(err){
-        console.log("Error in doctor create controller",err);
-        return res.status(500).json({
-            message: "Internal server error"
-        })
-    }
+    }catch(err){}
 }
 

[Survived] StringLiteral
controller/api/v1/doctor_controller.js:26:21
             }
         }
     }catch(err){
-        console.log("Error in doctor create controller",err);
+        console.log("",err);
         return res.status(500).json({
             message: "Internal server error"

[Survived] ObjectLiteral
controller/api/v1/doctor_controller.js:27:37
         }
     }catch(err){
         console.log("Error in doctor create controller",err);
-        return res.status(500).json({
-            message: "Internal server error"
-        })
+        return res.status(500).json({})
     }
 }

[Timeout] BlockStatement
controller/api/v1/doctor_controller.js:35:55
 
 
 //handling doctor signin
-module.exports.createSession = async function(req,res){
-    try{
-        let doctor = await Doctor.findOne({email: req.body.email});
-
-        if(!doctor || doctor.password != req.body.password){
-            return res.status(422).json({
-                message: "Invalid username/password"
-            });
-        }
-
-        return res.status(200).json({
-            message: 'Sign in successful.Here is your token',
-            data: {
-                //this will generate the jwt token and send in response
-                token: jwt.sign(doctor.toJSON(),'verysecret',{expiresIn: '1h'})
-            }
-        }) 
-    }catch(err){
-        console.log('Error in doctor create session controller', err);
-        return res.status(500).json({
-            message: "Internal server error"
-        })
-    }
-}
+module.exports.createSession = async function(req,res){}

[Timeout] BlockStatement
controller/api/v1/doctor_controller.js:36:8
 
 //handling doctor signin
 module.exports.createSession = async function(req,res){
-    try{
-        let doctor = await Doctor.findOne({email: req.body.email});
-
-        if(!doctor || doctor.password != req.body.password){
-            return res.status(422).json({
-                message: "Invalid username/password"
-            });
-        }
-
-        return res.status(200).json({
-            message: 'Sign in successful.Here is your token',
-            data: {
-                //this will generate the jwt token and send in response
-                token: jwt.sign(doctor.toJSON(),'verysecret',{expiresIn: '1h'})
-            }
-        }) 
-    }catch(err){
+    try{}catch(err){
         console.log('Error in doctor create session controller', err);
         return res.status(500).json({

[Survived] ObjectLiteral
controller/api/v1/doctor_controller.js:37:43
 //handling doctor signin
 module.exports.createSession = async function(req,res){
     try{
-        let doctor = await Doctor.findOne({email: req.body.email});
+        let doctor = await Doctor.findOne({});
 
         if(!doctor || doctor.password != req.body.password){

[Killed] BooleanLiteral
controller/api/v1/doctor_controller.js:39:12
     try{
         let doctor = await Doctor.findOne({email: req.body.email});
 
-        if(!doctor || doctor.password != req.body.password){
+        if(doctor || doctor.password != req.body.password){
             return res.status(422).json({
                 message: "Invalid username/password"
killedBy: Hospital API Integration Tests should login doctor and return JWT token via /api/v1/doctors/login
statusReason: expected Response{ _events: {}, …(35), …(2) } to have property 'status' of 200, but got 422

[Killed] EqualityOperator
controller/api/v1/doctor_controller.js:39:23
     try{
         let doctor = await Doctor.findOne({email: req.body.email});
 
-        if(!doctor || doctor.password != req.body.password){
+        if(!doctor || doctor.password == req.body.password){
             return res.status(422).json({
                 message: "Invalid username/password"
killedBy: Hospital API Integration Tests should login doctor and return JWT token via /api/v1/doctors/login
statusReason: expected Response{ _events: {}, …(35), …(2) } to have property 'status' of 200, but got 422

[Killed] ObjectLiteral
controller/api/v1/doctor_controller.js:47:19
 
         return res.status(200).json({
             message: 'Sign in successful.Here is your token',
-            data: {
-                //this will generate the jwt token and send in response
-                token: jwt.sign(doctor.toJSON(),'verysecret',{expiresIn: '1h'})
-            }
+            data: {}
         }) 
     }catch(err){
killedBy: Hospital API Integration Tests should login doctor and return JWT token via /api/v1/doctors/login
statusReason: expected {} to have property 'token'

[Survived] BlockStatement
controller/api/v1/doctor_controller.js:52:16
                 token: jwt.sign(doctor.toJSON(),'verysecret',{expiresIn: '1h'})
             }
         }) 
-    }catch(err){
-        console.log('Error in doctor create session controller', err);
-        return res.status(500).json({
-            message: "Internal server error"
-        })
-    }
+    }catch(err){}
 }

[Survived] ObjectLiteral
controller/api/v1/doctor_controller.js:54:37
         }) 
     }catch(err){
         console.log('Error in doctor create session controller', err);
-        return res.status(500).json({
-            message: "Internal server error"
-        })
+        return res.status(500).json({})
     }
 }
