[Timeout] BlockStatement
controller/api/v1/patient_controller.js:5:51
 
 
 //handling new patient registration
-module.exports.create = async function (req, res) {
-  try {
-    let patient = await Patient.findOne({ phone: req.body.phone });
-    if (patient) {
-      return res.status(200).json({
-        message: "Patient already exist",
-        data: patient,
-      });
-    } else {
-      await Patient.create({
-        ...req.body,
-        doctor: req.user._id,
-      });
-      return res.status(200).json({
-        message: "Patient created",
-      });
-    }
-  } catch (err) {
-    console.log("error in patient create controller", err);
-    return res.status(500).json({
-      message: "Internal server error",
-    });
-  }
-};
+module.exports.create = async function (req, res) {};
 
 

[Timeout] BlockStatement
controller/api/v1/patient_controller.js:6:7
 
 //handling new patient registration
 module.exports.create = async function (req, res) {
-  try {
-    let patient = await Patient.findOne({ phone: req.body.phone });
-    if (patient) {
-      return res.status(200).json({
-        message: "Patient already exist",
-        data: patient,
-      });
-    } else {
-      await Patient.create({
-        ...req.body,
-        doctor: req.user._id,
-      });
-      return res.status(200).json({
-        message: "Patient created",
-      });
-    }
-  } catch (err) {
+  try {} catch (err) {
     console.log("error in patient create controller", err);
     return res.status(500).json({

[Killed] ConditionalExpression
controller/api/v1/patient_controller.js:8:9
 module.exports.create = async function (req, res) {
   try {
     let patient = await Patient.findOne({ phone: req.body.phone });
-    if (patient) {
+    if (true) {
       return res.status(200).json({
         message: "Patient already exist",
killedBy: Hospital API Integration Tests should create a patient for a logged in doctor and fetch by status
statusReason: expected { …(2) } to have property 'message' of 'Patient created', but got 'Patient already exist'

[Survived] BlockStatement
controller/api/v1/patient_controller.js:8:18
 module.exports.create = async function (req, res) {
   try {
     let patient = await Patient.findOne({ phone: req.body.phone });
-    if (patient) {
-      return res.status(200).json({
-        message: "Patient already exist",
-        data: patient,
-      });
-    } else {
+    if (patient) {} else {
       await Patient.create({
         ...req.body,

[Timeout] BlockStatement
controller/api/v1/patient_controller.js:13:12
         message: "Patient already exist",
         data: patient,
       });
-    } else {
-      await Patient.create({
-        ...req.body,
-        doctor: req.user._id,
-      });
-      return res.status(200).json({
-        message: "Patient created",
-      });
-    }
+    } else {}
   } catch (err) {
     console.log("error in patient create controller", err);

[Killed] StringLiteral
controller/api/v1/patient_controller.js:19:18
         doctor: req.user._id,
       });
       return res.status(200).json({
-        message: "Patient created",
+        message: "",
       });
     }
killedBy: Hospital API Integration Tests should create a patient for a logged in doctor and fetch by status
statusReason: expected { message: '' } to have property 'message' of 'Patient created', but got ''

[Survived] BlockStatement
controller/api/v1/patient_controller.js:22:17
         message: "Patient created",
       });
     }
-  } catch (err) {
-    console.log("error in patient create controller", err);
-    return res.status(500).json({
-      message: "Internal server error",
-    });
-  }
+  } catch (err) {}
 };
 

[Survived] BlockStatement
controller/api/v1/patient_controller.js:33:7
 
 //handling individual patient report generation
 module.exports.report = async function (req, res) {
-  try {
-    let patient = await Patient.findOne({ phone: req.params.phone }).populate({
-      path: "doctor",
-      select: ["name"],    //this will only give the name of the doctor and not the entire doctor details
-    });
-
-    //converting each status code to respective full status name
-    if (patient) {
-      if (patient.status == "neg") patient.status = "Negative";
-      else if (patient.status == "trav-quar")
-        patient.status = "Travelled-Quarantine";
-      else if (patient.status == "sym-quar")
-        patient.status = "Symptoms-Quarantine";
-      else if (patient.status == "pos-admit") patient.status = "Positive-Admit";
-      return res.status(200).json({
-        message: "Patient report generated.Here are the details",
-        data: patient,
-      });
-    } else {
-      return res.status(404).json({
-        message: "Sorry the patient not found.Kindly verify the phone number",
-      });
-    }
-  } catch (err) {
+  try {} catch (err) {
     console.log("Error in single patient report controller", err);
     return res.status(500).json({

[Survived] StringLiteral
controller/api/v1/patient_controller.js:36:16
   try {
     let patient = await Patient.findOne({ phone: req.params.phone }).populate({
       path: "doctor",
-      select: ["name"],    //this will only give the name of the doctor and not the entire doctor details
+      select: [""],    //this will only give the name of the doctor and not the entire doctor details
     });
 

[Survived] BlockStatement
controller/api/v1/patient_controller.js:40:18
     });
 
     //converting each status code to respective full status name
-    if (patient) {
-      if (patient.status == "neg") patient.status = "Negative";
-      else if (patient.status == "trav-quar")
-        patient.status = "Travelled-Quarantine";
-      else if (patient.status == "sym-quar")
-        patient.status = "Symptoms-Quarantine";
-      else if (patient.status == "pos-admit") patient.status = "Positive-Admit";
-      return res.status(200).json({
-        message: "Patient report generated.Here are the details",
-        data: patient,
-      });
-    } else {
+    if (patient) {} else {
       return res.status(404).json({
         message: "Sorry the patient not found.Kindly verify the phone number",

[Survived] ConditionalExpression
controller/api/v1/patient_controller.js:40:9
     });
 
     //converting each status code to respective full status name
-    if (patient) {
+    if (true) {
       if (patient.status == "neg") patient.status = "Negative";
       else if (patient.status == "trav-quar")

[Survived] EqualityOperator
controller/api/v1/patient_controller.js:41:11
 
     //converting each status code to respective full status name
     if (patient) {
-      if (patient.status == "neg") patient.status = "Negative";
+      if (patient.status != "neg") patient.status = "Negative";
       else if (patient.status == "trav-quar")
         patient.status = "Travelled-Quarantine";

[Survived] ConditionalExpression
controller/api/v1/patient_controller.js:41:11
 
     //converting each status code to respective full status name
     if (patient) {
-      if (patient.status == "neg") patient.status = "Negative";
+      if (false) patient.status = "Negative";
       else if (patient.status == "trav-quar")
         patient.status = "Travelled-Quarantine";

[Survived] ConditionalExpression
controller/api/v1/patient_controller.js:42:16
     //converting each status code to respective full status name
     if (patient) {
       if (patient.status == "neg") patient.status = "Negative";
-      else if (patient.status == "trav-quar")
+      else if (false)
         patient.status = "Travelled-Quarantine";
       else if (patient.status == "sym-quar")

[Survived] EqualityOperator
controller/api/v1/patient_controller.js:42:16
     //converting each status code to respective full status name
     if (patient) {
       if (patient.status == "neg") patient.status = "Negative";
-      else if (patient.status == "trav-quar")
+      else if (patient.status != "trav-quar")
         patient.status = "Travelled-Quarantine";
       else if (patient.status == "sym-quar")

[Survived] ConditionalExpression
controller/api/v1/patient_controller.js:44:16
       if (patient.status == "neg") patient.status = "Negative";
       else if (patient.status == "trav-quar")
         patient.status = "Travelled-Quarantine";
-      else if (patient.status == "sym-quar")
+      else if (true)
         patient.status = "Symptoms-Quarantine";
       else if (patient.status == "pos-admit") patient.status = "Positive-Admit";

[Survived] EqualityOperator
controller/api/v1/patient_controller.js:44:16
       if (patient.status == "neg") patient.status = "Negative";
       else if (patient.status == "trav-quar")
         patient.status = "Travelled-Quarantine";
-      else if (patient.status == "sym-quar")
+      else if (patient.status != "sym-quar")
         patient.status = "Symptoms-Quarantine";
       else if (patient.status == "pos-admit") patient.status = "Positive-Admit";

[Survived] ConditionalExpression
controller/api/v1/patient_controller.js:46:16
         patient.status = "Travelled-Quarantine";
       else if (patient.status == "sym-quar")
         patient.status = "Symptoms-Quarantine";
-      else if (patient.status == "pos-admit") patient.status = "Positive-Admit";
+      else if (true) patient.status = "Positive-Admit";
       return res.status(200).json({
         message: "Patient report generated.Here are the details",

[Survived] ConditionalExpression
controller/api/v1/patient_controller.js:46:16
         patient.status = "Travelled-Quarantine";
       else if (patient.status == "sym-quar")
         patient.status = "Symptoms-Quarantine";
-      else if (patient.status == "pos-admit") patient.status = "Positive-Admit";
+      else if (false) patient.status = "Positive-Admit";
       return res.status(200).json({
         message: "Patient report generated.Here are the details",

[Survived] StringLiteral
controller/api/v1/patient_controller.js:48:18
         patient.status = "Symptoms-Quarantine";
       else if (patient.status == "pos-admit") patient.status = "Positive-Admit";
       return res.status(200).json({
-        message: "Patient report generated.Here are the details",
+        message: "",
         data: patient,
       });

[Survived] BlockStatement
controller/api/v1/patient_controller.js:51:12
         message: "Patient report generated.Here are the details",
         data: patient,
       });
-    } else {
-      return res.status(404).json({
-        message: "Sorry the patient not found.Kindly verify the phone number",
-      });
-    }
+    } else {}
   } catch (err) {
     console.log("Error in single patient report controller", err);

[Survived] StringLiteral
controller/api/v1/patient_controller.js:53:18
       });
     } else {
       return res.status(404).json({
-        message: "Sorry the patient not found.Kindly verify the phone number",
+        message: "",
       });
     }

[Survived] BlockStatement
controller/api/v1/patient_controller.js:56:17
         message: "Sorry the patient not found.Kindly verify the phone number",
       });
     }
-  } catch (err) {
-    console.log("Error in single patient report controller", err);
-    return res.status(500).json({
-      message: "Internal server error",
-    });
-  }
+  } catch (err) {}
 };
 

[Survived] MethodExpression
controller/api/v1/patient_controller.js:67:26
 //handling report generation of all patients
 module.exports.reportAll = async function (req, res) {
   try {
-    let patients = await Patient.find({})
-      .sort({ createdAt: 1 })      //sorting ascending
+    let patients = await Patient.find({})      //sorting ascending
       .populate({
         path: "doctor",

[Survived] ArrayDeclaration
controller/api/v1/patient_controller.js:71:17
       .sort({ createdAt: 1 })      //sorting ascending
       .populate({
         path: "doctor",
-        select: ["name"],
+        select: [],
       });
     if (patients) {

[Survived] ConditionalExpression
controller/api/v1/patient_controller.js:73:9
         path: "doctor",
         select: ["name"],
       });
-    if (patients) {
+    if (false) {
       patients.map((patient) => {
         if (patient.status == "neg") return (patient.status = "Negative");

[Survived] BlockStatement
controller/api/v1/patient_controller.js:73:19
         path: "doctor",
         select: ["name"],
       });
-    if (patients) {
-      patients.map((patient) => {
-        if (patient.status == "neg") return (patient.status = "Negative");
-        else if (patient.status == "trav-quar")
-          return (patient.status = "Travelled-Quarantine");
-        else if (patient.status == "sym-quar")
-          return (patient.status = "Symptoms-Quarantine");
-        else if (patient.status == "pos-admit")
-          return (patient.status = "Positive-Admit");
-      });
-      return res.status(200).json({
-        message: "All "+patients.length+" patient report generated",
-        data: patients,
-      });
-    } else {
+    if (patients) {} else {
       return res.status(404).json({
         message: "No patients",

[Survived] BlockStatement
controller/api/v1/patient_controller.js:74:33
         select: ["name"],
       });
     if (patients) {
-      patients.map((patient) => {
-        if (patient.status == "neg") return (patient.status = "Negative");
-        else if (patient.status == "trav-quar")
-          return (patient.status = "Travelled-Quarantine");
-        else if (patient.status == "sym-quar")
-          return (patient.status = "Symptoms-Quarantine");
-        else if (patient.status == "pos-admit")
-          return (patient.status = "Positive-Admit");
-      });
+      patients.map((patient) => {});
       return res.status(200).json({
         message: "All "+patients.length+" patient report generated",

[Survived] ConditionalExpression
controller/api/v1/patient_controller.js:75:13
       });
     if (patients) {
       patients.map((patient) => {
-        if (patient.status == "neg") return (patient.status = "Negative");
+        if (false) return (patient.status = "Negative");
         else if (patient.status == "trav-quar")
           return (patient.status = "Travelled-Quarantine");

[Survived] EqualityOperator
controller/api/v1/patient_controller.js:75:13
       });
     if (patients) {
       patients.map((patient) => {
-        if (patient.status == "neg") return (patient.status = "Negative");
+        if (patient.status != "neg") return (patient.status = "Negative");
         else if (patient.status == "trav-quar")
           return (patient.status = "Travelled-Quarantine");

[Survived] ConditionalExpression
controller/api/v1/patient_controller.js:76:18
     if (patients) {
       patients.map((patient) => {
         if (patient.status == "neg") return (patient.status = "Negative");
-        else if (patient.status == "trav-quar")
+        else if (true)
           return (patient.status = "Travelled-Quarantine");
         else if (patient.status == "sym-quar")

[Survived] EqualityOperator
controller/api/v1/patient_controller.js:76:18
     if (patients) {
       patients.map((patient) => {
         if (patient.status == "neg") return (patient.status = "Negative");
-        else if (patient.status == "trav-quar")
+        else if (patient.status != "trav-quar")
           return (patient.status = "Travelled-Quarantine");
         else if (patient.status == "sym-quar")

[Survived] EqualityOperator
controller/api/v1/patient_controller.js:78:18
         if (patient.status == "neg") return (patient.status = "Negative");
         else if (patient.status == "trav-quar")
           return (patient.status = "Travelled-Quarantine");
-        else if (patient.status == "sym-quar")
+        else if (patient.status != "sym-quar")
           return (patient.status = "Symptoms-Quarantine");
         else if (patient.status == "pos-admit")

[Survived] ConditionalExpression
controller/api/v1/patient_controller.js:78:18
         if (patient.status == "neg") return (patient.status = "Negative");
         else if (patient.status == "trav-quar")
           return (patient.status = "Travelled-Quarantine");
-        else if (patient.status == "sym-quar")
+        else if (true)
           return (patient.status = "Symptoms-Quarantine");
         else if (patient.status == "pos-admit")

[Survived] StringLiteral
controller/api/v1/patient_controller.js:79:36
         else if (patient.status == "trav-quar")
           return (patient.status = "Travelled-Quarantine");
         else if (patient.status == "sym-quar")
-          return (patient.status = "Symptoms-Quarantine");
+          return (patient.status = "");
         else if (patient.status == "pos-admit")
           return (patient.status = "Positive-Admit");

[Survived] EqualityOperator
controller/api/v1/patient_controller.js:80:18
           return (patient.status = "Travelled-Quarantine");
         else if (patient.status == "sym-quar")
           return (patient.status = "Symptoms-Quarantine");
-        else if (patient.status == "pos-admit")
+        else if (patient.status != "pos-admit")
           return (patient.status = "Positive-Admit");
       });

[Survived] ConditionalExpression
controller/api/v1/patient_controller.js:80:18
           return (patient.status = "Travelled-Quarantine");
         else if (patient.status == "sym-quar")
           return (patient.status = "Symptoms-Quarantine");
-        else if (patient.status == "pos-admit")
+        else if (true)
           return (patient.status = "Positive-Admit");
       });

[Survived] ObjectLiteral
controller/api/v1/patient_controller.js:83:35
         else if (patient.status == "pos-admit")
           return (patient.status = "Positive-Admit");
       });
-      return res.status(200).json({
-        message: "All "+patients.length+" patient report generated",
-        data: patients,
-      });
+      return res.status(200).json({});
     } else {
       return res.status(404).json({

[Survived] BlockStatement
controller/api/v1/patient_controller.js:87:12
         message: "All "+patients.length+" patient report generated",
         data: patients,
       });
-    } else {
-      return res.status(404).json({
-        message: "No patients",
-      });
-    }
+    } else {}
   } catch (err) {
     console.log("Error in all patient report controller", err);

[Survived] ObjectLiteral
controller/api/v1/patient_controller.js:88:35
         data: patients,
       });
     } else {
-      return res.status(404).json({
-        message: "No patients",
-      });
+      return res.status(404).json({});
     }
   } catch (err) {

[Survived] BlockStatement
controller/api/v1/patient_controller.js:92:17
         message: "No patients",
       });
     }
-  } catch (err) {
-    console.log("Error in all patient report controller", err);
-    return res.status(500).json({
-      message: "Internal server error",
-    });
-  }
+  } catch (err) {}
 };
 

[Survived] ObjectLiteral
controller/api/v1/patient_controller.js:94:33
     }
   } catch (err) {
     console.log("Error in all patient report controller", err);
-    return res.status(500).json({
-      message: "Internal server error",
-    });
+    return res.status(500).json({});
   }
 };

[Survived] StringLiteral
controller/api/v1/patient_controller.js:95:16
   } catch (err) {
     console.log("Error in all patient report controller", err);
     return res.status(500).json({
-      message: "Internal server error",
+      message: "",
     });
   }

[Survived] BlockStatement
controller/api/v1/patient_controller.js:101:57
 };
 
 //handling the status change for patients(extra feature)
-module.exports.updatestatus = async function (req, res) {
-  try {
-    let patient = await Patient.findOne({ phone: req.params.phone });
-    if(!patient){
-      return res.status(404).json({
-        message: "Patient not found.Kindly verify the phone number"
-      });
-    }
-    else {
-      patient.status = req.body.newstatus;
-      await patient.save();
-      return res.status(200).json({
-        message: "Patient status updated.Here are the updated details",
-        data: patient,
-      });
-    }
-  } catch (err) {
-    console.log("Error in status change controller", err);
-    return res.status(500).json({
-      message: "Internal server error",
-    });
-  }
-};
+module.exports.updatestatus = async function (req, res) {};
 
 //handling the report generation of all patients of particular status

[Survived] BlockStatement
controller/api/v1/patient_controller.js:102:7
 
 //handling the status change for patients(extra feature)
 module.exports.updatestatus = async function (req, res) {
-  try {
-    let patient = await Patient.findOne({ phone: req.params.phone });
-    if(!patient){
-      return res.status(404).json({
-        message: "Patient not found.Kindly verify the phone number"
-      });
-    }
-    else {
-      patient.status = req.body.newstatus;
-      await patient.save();
-      return res.status(200).json({
-        message: "Patient status updated.Here are the updated details",
-        data: patient,
-      });
-    }
-  } catch (err) {
+  try {} catch (err) {
     console.log("Error in status change controller", err);
     return res.status(500).json({

[Survived] BlockStatement
controller/api/v1/patient_controller.js:104:17
 module.exports.updatestatus = async function (req, res) {
   try {
     let patient = await Patient.findOne({ phone: req.params.phone });
-    if(!patient){
-      return res.status(404).json({
-        message: "Patient not found.Kindly verify the phone number"
-      });
-    }
+    if(!patient){}
     else {
       patient.status = req.body.newstatus;

[Survived] BooleanLiteral
controller/api/v1/patient_controller.js:104:8
 module.exports.updatestatus = async function (req, res) {
   try {
     let patient = await Patient.findOne({ phone: req.params.phone });
-    if(!patient){
+    if(patient){
       return res.status(404).json({
         message: "Patient not found.Kindly verify the phone number"

[Survived] BlockStatement
controller/api/v1/patient_controller.js:109:10
         message: "Patient not found.Kindly verify the phone number"
       });
     }
-    else {
-      patient.status = req.body.newstatus;
-      await patient.save();
-      return res.status(200).json({
-        message: "Patient status updated.Here are the updated details",
-        data: patient,
-      });
-    }
+    else {}
   } catch (err) {
     console.log("Error in status change controller", err);

[Survived] ObjectLiteral
controller/api/v1/patient_controller.js:112:35
     else {
       patient.status = req.body.newstatus;
       await patient.save();
-      return res.status(200).json({
-        message: "Patient status updated.Here are the updated details",
-        data: patient,
-      });
+      return res.status(200).json({});
     }
   } catch (err) {

[Survived] StringLiteral
controller/api/v1/patient_controller.js:113:18
       patient.status = req.body.newstatus;
       await patient.save();
       return res.status(200).json({
-        message: "Patient status updated.Here are the updated details",
+        message: "",
         data: patient,
       });

[Survived] BlockStatement
controller/api/v1/patient_controller.js:117:17
         data: patient,
       });
     }
-  } catch (err) {
-    console.log("Error in status change controller", err);
-    return res.status(500).json({
-      message: "Internal server error",
-    });
-  }
+  } catch (err) {}
 };
 

[Survived] MethodExpression
controller/api/v1/patient_controller.js:129:26
 module.exports.status = async function (req, res) {
   try {
     let status;
-    let patients = await Patient.find({ status: req.params.status })
-      .sort({ createdAt: 1 })
+    let patients = await Patient.find({
+  status: req.params.status
+})
       .populate({
         path: "doctor",

[Survived] ObjectLiteral
controller/api/v1/patient_controller.js:129:39
 module.exports.status = async function (req, res) {
   try {
     let status;
-    let patients = await Patient.find({ status: req.params.status })
+    let patients = await Patient.find({})
       .sort({ createdAt: 1 })
       .populate({

[Killed] EqualityOperator
controller/api/v1/patient_controller.js:135:9
         path: "doctor",
         select: ["name"],
       });
-    if (patients.length>0) {
+    if (patients.length <= 0) {
       patients.map((patient) => {
         if (patient.status == "neg") {
killedBy: Hospital API Integration Tests should create a patient for a logged in doctor and fetch by status
statusReason: expected Response{ _events: {}, …(35), …(2) } to have property 'status' of 200, but got 404

[Killed] ConditionalExpression
controller/api/v1/patient_controller.js:135:9
         path: "doctor",
         select: ["name"],
       });
-    if (patients.length>0) {
+    if (false) {
       patients.map((patient) => {
         if (patient.status == "neg") {
killedBy: Hospital API Integration Tests should create a patient for a logged in doctor and fetch by status
statusReason: expected Response{ _events: {}, …(35), …(2) } to have property 'status' of 200, but got 404

[Survived] BlockStatement
controller/api/v1/patient_controller.js:136:33
         select: ["name"],
       });
     if (patients.length>0) {
-      patients.map((patient) => {
-        if (patient.status == "neg") {
-          status = "Negative";
-          return (patient.status = status);
-        } else if (patient.status == "trav-quar") {
-          status = "Travelled-Quarantine";
-          return (patient.status = status);
-        } else if (patient.status == "sym-quar") {
-          status = "Symptoms-Quarantine";
-          return (patient.status = status);
-        } else if (patient.status == "pos-admit") {
-          status = "Positive-Admit";
-          return (patient.status = status);
-        }
-      });
+      patients.map((patient) => {});
       return res.status(200).json({
         message:

[Survived] EqualityOperator
controller/api/v1/patient_controller.js:137:13
       });
     if (patients.length>0) {
       patients.map((patient) => {
-        if (patient.status == "neg") {
+        if (patient.status != "neg") {
           status = "Negative";
           return (patient.status = status);

[Survived] BlockStatement
controller/api/v1/patient_controller.js:137:38
       });
     if (patients.length>0) {
       patients.map((patient) => {
-        if (patient.status == "neg") {
-          status = "Negative";
-          return (patient.status = status);
-        } else if (patient.status == "trav-quar") {
+        if (patient.status == "neg") {} else if (patient.status == "trav-quar") {
           status = "Travelled-Quarantine";
           return (patient.status = status);

[Survived] ConditionalExpression
controller/api/v1/patient_controller.js:140:20
         if (patient.status == "neg") {
           status = "Negative";
           return (patient.status = status);
-        } else if (patient.status == "trav-quar") {
+        } else if (false) {
           status = "Travelled-Quarantine";
           return (patient.status = status);

[Survived] BlockStatement
controller/api/v1/patient_controller.js:140:51
         if (patient.status == "neg") {
           status = "Negative";
           return (patient.status = status);
-        } else if (patient.status == "trav-quar") {
-          status = "Travelled-Quarantine";
-          return (patient.status = status);
-        } else if (patient.status == "sym-quar") {
+        } else if (patient.status == "trav-quar") {} else if (patient.status == "sym-quar") {
           status = "Symptoms-Quarantine";
           return (patient.status = status);

[Survived] StringLiteral
controller/api/v1/patient_controller.js:141:20
           status = "Negative";
           return (patient.status = status);
         } else if (patient.status == "trav-quar") {
-          status = "Travelled-Quarantine";
+          status = "";
           return (patient.status = status);
         } else if (patient.status == "sym-quar") {

[Survived] ConditionalExpression
controller/api/v1/patient_controller.js:143:20
         } else if (patient.status == "trav-quar") {
           status = "Travelled-Quarantine";
           return (patient.status = status);
-        } else if (patient.status == "sym-quar") {
+        } else if (false) {
           status = "Symptoms-Quarantine";
           return (patient.status = status);

[Survived] BlockStatement
controller/api/v1/patient_controller.js:143:50
         } else if (patient.status == "trav-quar") {
           status = "Travelled-Quarantine";
           return (patient.status = status);
-        } else if (patient.status == "sym-quar") {
-          status = "Symptoms-Quarantine";
-          return (patient.status = status);
-        } else if (patient.status == "pos-admit") {
+        } else if (patient.status == "sym-quar") {} else if (patient.status == "pos-admit") {
           status = "Positive-Admit";
           return (patient.status = status);

[Survived] ConditionalExpression
controller/api/v1/patient_controller.js:146:20
         } else if (patient.status == "sym-quar") {
           status = "Symptoms-Quarantine";
           return (patient.status = status);
-        } else if (patient.status == "pos-admit") {
+        } else if (false) {
           status = "Positive-Admit";
           return (patient.status = status);

[Survived] ConditionalExpression
controller/api/v1/patient_controller.js:146:20
         } else if (patient.status == "sym-quar") {
           status = "Symptoms-Quarantine";
           return (patient.status = status);
-        } else if (patient.status == "pos-admit") {
+        } else if (true) {
           status = "Positive-Admit";
           return (patient.status = status);
