[Survived] BlockStatement
controller/api/v1/patient_controller.js:156:12
           "All "+patients.length+" patient with status " + status + " report generated",
         data: patients,
       });
-    } else {
-      return res.status(404).json({
-        message: "No patients found",
-      });
-    }
+    } else {}
   } catch (err) {
     console.log("Error in all patient report controller", err);
