[Survived] BlockStatement
index.js:31:33
 const port = 8000;
 
 // start the server only when running the app, not in tests
-app.listen(port, function (err) {
-  if (err) {
-    console.log('error in creating server', err);
-    return;
-  }
-  console.log('Server running on port ' + port);
-});
+app.listen(port, function (err) {});
 

[Survived] ConditionalExpression
index.js:32:7
 
 // start the server only when running the app, not in tests
 app.listen(port, function (err) {
-  if (err) {
+  if (false) {
     console.log('error in creating server', err);
     return;

[Survived] BlockStatement
index.js:32:12
 
 // start the server only when running the app, not in tests
 app.listen(port, function (err) {
-  if (err) {
-    console.log('error in creating server', err);
-    return;
-  }
+  if (err) {}
   console.log('Server running on port ' + port);
 });

[Survived] StringLiteral
index.js:36:15
     console.log('error in creating server', err);
     return;
   }
-  console.log('Server running on port ' + port);
+  console.log("" + port);
 });
 
