[Survived] ObjectLiteral
models/doctor.js:6:11
 // schema for doctor
 const doctorSchema = new mongoose.Schema(
   {
-    name: {
-      type: String,
-      required: true,
-    },
+    name: {},
     email: {
       type: String,

[Survived] ObjectLiteral
models/doctor.js:10:12
       type: String,
       required: true,
     },
-    email: {
-      type: String,
-      required: true,
-      unique: true,
-    },
+    email: {},
     password: {
       type: String,

[Survived] ObjectLiteral
models/doctor.js:15:15
       required: true,
       unique: true,
     },
-    password: {
-      type: String,
-      required: true,
-    },
+    password: {},
   },
   {

[Killed] StringLiteral
models/doctor.js:25:31
   }
 );
 
-const Doctor = mongoose.model("Doctor", doctorSchema);
+const Doctor = mongoose.model("", doctorSchema);
 
 module.exports = Doctor;
killedBy: Hospital API Integration Tests should create a patient for a logged in doctor and fetch by status
statusReason: expected Response{ _events: {}, …(35), …(2) } to have property 'status' of 200, but got 500
