[Killed] ObjectLiteral
models/patient.js:5:3
 
 //schema for patients
 const patientSchema = new mongoose.Schema(
-  {
-    name: {
-      type: String,
-      required: true,
-    },
-    phone: {
-      type: Number,
-      required: true,
-      unique: true,
-    },
-    age: {
-      type: Number,
-      required: true,
-    },
-    status: {
-      type: String,
-      enum: ["neg", "trav-quar", "sym-quar", "pos-admit"],
-      required: true
-    },
-    doctor: {
-      type: mongoose.Schema.Types.ObjectId,
-      ref: "Doctor",
-    },
-  },
+  {},
   {
     timestamps: true,
killedBy: Hospital API Integration Tests should create a patient for a logged in doctor and fetch by status
statusReason: expected Response{ _events: {}, …(35), …(2) } to have property 'status' of 200, but got 404

[Survived] ObjectLiteral
models/patient.js:10:12
       type: String,
       required: true,
     },
-    phone: {
-      type: Number,
-      required: true,
-      unique: true,
-    },
+    phone: {},
     age: {
       type: Number,

[Survived] BooleanLiteral
models/patient.js:12:17
     },
     phone: {
       type: Number,
-      required: true,
+      required: false,
       unique: true,
     },

[Killed] StringLiteral
models/patient.js:21:14
     },
     status: {
       type: String,
-      enum: ["neg", "trav-quar", "sym-quar", "pos-admit"],
+      enum: ["", "trav-quar", "sym-quar", "pos-admit"],
       required: true
     },
killedBy: Hospital API Integration Tests should create a patient for a logged in doctor and fetch by status
statusReason: expected Response{ _events: {}, …(35), …(2) } to have property 'status' of 200, but got 500

[Survived] BooleanLiteral
models/patient.js:22:17
     status: {
       type: String,
       enum: ["neg", "trav-quar", "sym-quar", "pos-admit"],
-      required: true
+      required: false
     },
     doctor: {

[Killed] StringLiteral
models/patient.js:26:12
     },
     doctor: {
       type: mongoose.Schema.Types.ObjectId,
-      ref: "Doctor",
+      ref: "",
     },
   },
killedBy: Hospital API Integration Tests should create a patient for a logged in doctor and fetch by status
statusReason: expected Response{ _events: {}, …(35), …(2) } to have property 'status' of 200, but got 500

[Survived] StringLiteral
models/patient.js:34:32
   }
 );
 
-const Patient = mongoose.model("Patient", patientSchema);
+const Patient = mongoose.model("", patientSchema);
 
 module.exports = Patient;
