[Killed] StringLiteral
routes/api/index.js:6:12
 const router = express.Router();
 
 //forwarding according to api version
-router.use('/v1',require('./v1'));
+router.use("",require('./v1'));
 
 module.exports = router;
killedBy: Hospital API Integration Tests should register a doctor via /api/v1/doctors/register
statusReason: expected Response{ _events: {}, …(34), …(2) } to have property 'status' of 200, but got 404
