[Killed] StringLiteral
routes/api/v1/doctor.js:7:12
 const doctorController = require('../../../controller/api/v1/doctor_controller');
 
 router.post('/register',doctorController.create);
-router.get('/login',doctorController.createSession);
+router.get("",doctorController.createSession);
 
 module.exports = router;
killedBy: Hospital API Integration Tests should login doctor and return JWT token via /api/v1/doctors/login
statusReason: expected Response{ _events: {}, …(34), …(2) } to have property 'status' of 200, but got 404
