[Killed] StringLiteral
routes/api/v1/index.js:6:12
 const router = express.Router();
 
 //forwards to each individual routes
-router.use('/doctors',require('./doctor'));
+router.use("",require('./doctor'));
 router.use('/patients',require('./patient'));
 
killedBy: Hospital API Integration Tests should register a doctor via /api/v1/doctors/register
statusReason: expected Response{ _events: {}, …(34), …(2) } to have property 'status' of 200, but got 404
