[Killed] BooleanLiteral
routes/api/v1/patient.js:10:64
 
 
 //after the jwt authenticates the doctor details then it forwards to respective controller
-router.post('/register',passport.authenticate('jwt', {session: false}),patientController.create);
+router.post('/register',passport.authenticate('jwt', {session: true}),patientController.create);
 router.get('/create_report/:phone',passport.authenticate('jwt', {session: false}),patientController.report);
 router.get('/all_reports',passport.authenticate('jwt', {session: false}),patientController.reportAll);
killedBy: Hospital API Integration Tests should create a patient for a logged in doctor and fetch by status
statusReason: expected Response{ _events: {}, …(34), …(2) } to have property 'status' of 200, but got 500

[Killed] StringLiteral
routes/api/v1/patient.js:10:13
 
 
 //after the jwt authenticates the doctor details then it forwards to respective controller
-router.post('/register',passport.authenticate('jwt', {session: false}),patientController.create);
+router.post("",passport.authenticate('jwt', {session: false}),patientController.create);
 router.get('/create_report/:phone',passport.authenticate('jwt', {session: false}),patientController.report);
 router.get('/all_reports',passport.authenticate('jwt', {session: false}),patientController.reportAll);
killedBy: Hospital API Integration Tests should create a patient for a logged in doctor and fetch by status
statusReason: expected Response{ _events: {}, …(34), …(2) } to have property 'status' of 200, but got 404

[Survived] BooleanLiteral
routes/api/v1/patient.js:11:75
 
 //after the jwt authenticates the doctor details then it forwards to respective controller
 router.post('/register',passport.authenticate('jwt', {session: false}),patientController.create);
-router.get('/create_report/:phone',passport.authenticate('jwt', {session: false}),patientController.report);
+router.get('/create_report/:phone',passport.authenticate('jwt', {session: true}),patientController.report);
 router.get('/all_reports',passport.authenticate('jwt', {session: false}),patientController.reportAll);
 router.get('/update_status/:phone',passport.authenticate('jwt', {session: false}),patientController.updatestatus);

[Survived] StringLiteral
routes/api/v1/patient.js:11:58
 
 //after the jwt authenticates the doctor details then it forwards to respective controller
 router.post('/register',passport.authenticate('jwt', {session: false}),patientController.create);
-router.get('/create_report/:phone',passport.authenticate('jwt', {session: false}),patientController.report);
+router.get('/create_report/:phone',passport.authenticate("", {session: false}),patientController.report);
 router.get('/all_reports',passport.authenticate('jwt', {session: false}),patientController.reportAll);
 router.get('/update_status/:phone',passport.authenticate('jwt', {session: false}),patientController.updatestatus);

[Survived] BooleanLiteral
routes/api/v1/patient.js:12:66
 //after the jwt authenticates the doctor details then it forwards to respective controller
 router.post('/register',passport.authenticate('jwt', {session: false}),patientController.create);
 router.get('/create_report/:phone',passport.authenticate('jwt', {session: false}),patientController.report);
-router.get('/all_reports',passport.authenticate('jwt', {session: false}),patientController.reportAll);
+router.get('/all_reports',passport.authenticate('jwt', {session: true}),patientController.reportAll);
 router.get('/update_status/:phone',passport.authenticate('jwt', {session: false}),patientController.updatestatus);
 router.get('/status/:status',passport.authenticate('jwt', {session: false}),patientController.status);

[Survived] StringLiteral
routes/api/v1/patient.js:12:12
 //after the jwt authenticates the doctor details then it forwards to respective controller
 router.post('/register',passport.authenticate('jwt', {session: false}),patientController.create);
 router.get('/create_report/:phone',passport.authenticate('jwt', {session: false}),patientController.report);
-router.get('/all_reports',passport.authenticate('jwt', {session: false}),patientController.reportAll);
+router.get("",passport.authenticate('jwt', {session: false}),patientController.reportAll);
 router.get('/update_status/:phone',passport.authenticate('jwt', {session: false}),patientController.updatestatus);
 router.get('/status/:status',passport.authenticate('jwt', {session: false}),patientController.status);

[Survived] BooleanLiteral
routes/api/v1/patient.js:13:75
 router.post('/register',passport.authenticate('jwt', {session: false}),patientController.create);
 router.get('/create_report/:phone',passport.authenticate('jwt', {session: false}),patientController.report);
 router.get('/all_reports',passport.authenticate('jwt', {session: false}),patientController.reportAll);
-router.get('/update_status/:phone',passport.authenticate('jwt', {session: false}),patientController.updatestatus);
+router.get('/update_status/:phone',passport.authenticate('jwt', {session: true}),patientController.updatestatus);
 router.get('/status/:status',passport.authenticate('jwt', {session: false}),patientController.status);
 

[Killed] BooleanLiteral
routes/api/v1/patient.js:14:69
 router.get('/create_report/:phone',passport.authenticate('jwt', {session: false}),patientController.report);
 router.get('/all_reports',passport.authenticate('jwt', {session: false}),patientController.reportAll);
 router.get('/update_status/:phone',passport.authenticate('jwt', {session: false}),patientController.updatestatus);
-router.get('/status/:status',passport.authenticate('jwt', {session: false}),patientController.status);
+router.get('/status/:status',passport.authenticate('jwt', {session: true}),patientController.status);
 
 module.exports = router;
killedBy: Hospital API Integration Tests should create a patient for a logged in doctor and fetch by status
statusReason: expected Response{ _events: {}, …(34), …(2) } to have property 'status' of 200, but got 500

[Killed] StringLiteral
routes/api/v1/patient.js:14:52
 router.get('/create_report/:phone',passport.authenticate('jwt', {session: false}),patientController.report);
 router.get('/all_reports',passport.authenticate('jwt', {session: false}),patientController.reportAll);
 router.get('/update_status/:phone',passport.authenticate('jwt', {session: false}),patientController.updatestatus);
-router.get('/status/:status',passport.authenticate('jwt', {session: false}),patientController.status);
+router.get('/status/:status',passport.authenticate("", {session: false}),patientController.status);
 
 module.exports = router;
killedBy: Hospital API Integration Tests should create a patient for a logged in doctor and fetch by status
statusReason: expected Response{ _events: {}, …(33), …(2) } to have property 'status' of 200, but got 401
